src/Enums/РежимыФормированияРасходныхОрдеров/РежимыФормированияРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыФормированияРасходныхОрдеров</name>
  <enumValues>
    <name>Менеджером</name>
  </enumValues>
  <enumValues>
    <name>Кладовщиком</name>
  </enumValues>
  <enumValues>
    <name>Автоматически</name>
  </enumValues>
</mdclass:Enum>

src/Enums/РежимыФормированияРасходныхОрдеров/Forms/ВыборРежимаФормирования/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РежимФормированияРасходныхОрдеров = Параметры.РежимФормированияРасходныхОрдеров;
	
	Элементы.РежимФормированияРасходныхОрдеровАвтоматически.Подсказка =
		Перечисления.РежимыФормированияРасходныхОрдеров.ПодсказкаПоРежимуФормирования(Перечисления.РежимыФормированияРасходныхОрдеров.Автоматически);
	Элементы.РежимФормированияРасходныхОрдеровМенеджером.Подсказка =
		Перечисления.РежимыФормированияРасходныхОрдеров.ПодсказкаПоРежимуФормирования(Перечисления.РежимыФормированияРасходныхОрдеров.Менеджером);
	Элементы.РежимФормированияРасходныхОрдеровКладовщиком.Подсказка =
		Перечисления.РежимыФормированияРасходныхОрдеров.ПодсказкаПоРежимуФормирования(Перечисления.РежимыФормированияРасходныхОрдеров.Кладовщиком);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Если РежимФормированияРасходныхОрдеров = ПредопределенноеЗначение("Перечисление.РежимыФормированияРасходныхОрдеров.Автоматически") Тогда
		
		ТекстВопроса = НСтр("ru='После изменения режима на ""Автоматически"" для всех ордерных складов будет включено использование статусов расходных ордеров. Продолжить?';uk='Після зміни режиму на ""Автоматично"" для всіх ордерних складів буде включено використання статусів видаткових ордерів. Продовжити?'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОКЗавершение", ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		ОповеститьОВыборе(РежимФормированияРасходныхОрдеров);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОКЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ОповеститьОВыборе(РежимФормированияРасходныхОрдеров);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
